const poems = [
  "今我来思,雨雪霏霏",
  "君不见黄河之水天上，奔流到海不复回",
  "君不见高堂明镜悲白发，朝如青丝暮成雪",
  "靖康耻，犹未雪。臣子恨，何时灭。驾长车，踏破贺兰山缺",
  "多情自古伤离别，更那堪，冷落清秋节！今宵酒醒何处？杨柳岸，晓风残月",
  "执手相看泪眼，竟无语凝噎。念去去，千里烟波，暮霭沉沉楚天阔",
  "此去经年，应是良辰好景虚设。便纵有千种风情，更与何人说",
  "大江东去，浪淘尽，千古风流人物",
  "乱石穿空，惊涛拍岸，卷起千堆雪。江山如画，一时多少豪杰",
  "雄姿英发。羽扇纶巾，谈笑间、樯橹灰飞烟灭",
  "明月几时有？把酒问青天",
  "不知天上宫阙，今夕是何年",
  "我欲乘风归去，又恐琼楼玉宇，高处不胜寒",
  "转朱阁，低绮户，照无眠。不应有恨，何事长向别时圆？"
];

export default function getPoems() {
  const index = Math.floor(Math.random() * poems.length);
  // const res = poems[index];
  // poems.splice(index, 1);
  return poems[index];
}
